Revit 2024 API
BaseImportOptions.GetLayerSelection Method
 Get all set layers name which user want to import into Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ICollection<string> GetLayerSelection()
Visual Basic
Public Function GetLayerSelection As ICollection(Of String)
Visual C++
public:
ICollection<String^>^ GetLayerSelection()
Return Value
 The layers' name.
See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace